const addContentLang = (lang: number) => {
  switch (lang) {
    case 0:
      return ["Добавить фотографии", "Добавить видеозапись", "Добавить ссылку", "Добавить аудиозапись", "Добавить документ", "Создать мероприятие", "Добавить статью"];
    case 1:
    case 454:
      return ["Додати фотографії", "Додати відеозапис", "Додати посилання", "Додати аудіозапис", "Додати документ", "Створити захід", "Додати статтю"];
    case 114:
    case 2:
      return ["Дадаць фатаграфіі", "Дадаць відэазапіс", "Дадаць спасылку", "Дадаць аўдыёзапіс", "Дадаць дакумент", "Стварыць мерапрыемства", "Дадаць артыкул"];
    case 777:
      return ["Добавить фотокарточки", "Добавить киноленту", "Указать направление", "Добавить звукозапись", "Добавить документ", "Создать мероприятие", "Добавить статью"];
    case 97:
      return ["Фотосуреттерді қосу", "Бейнежазбаны қосу", "Сілтемені қосу", "Аудиожазбаны қосу", "Құжатты қосу", "Іс-шара жасау", "Мақала қосу"];
    case 100:
      return ["Добавить фотографіи", "Добавить видеозапись", "Добавить ссылку", "Добавить аудиозапись", "Добавить документ", "Создать мероприятие", "Добавить статью"];
    default:
      return ["Add photos", "Add video", "Add link", "Add audio", "Add document", "Create event", "Add article"];
  }
};

export default addContentLang;
