const getTextTTNum = (lang:number) => {
switch (lang) {
    case 0:
      return [
        "Количество сообщений в пределах нормы. Можете пользоваться мессенджером",
        "Количество сообщений приближается к ограничителю в 15.000.000. Будьте внимательны",
        "Количество сообщений приближается к ограничителю в 15.000.000. Рекомендуем скачать архив с сообщениями",
      ];
    case 1:
      return [
        "Кількість повідомлень у межах норми. Можете користуватися месенджером",
        "Кількість повідомлень наближається до ліміту до 15.000.000. Будьте уважні",
        "Кількість повідомлень наближається до ліміту до 15.000.000. Рекомендуємо завантажити архів із повідомленнями",
      ];
    case 454:
      return [
        "Кількість повідомлень у межах норми. Можете користуватися месенджером",
        "Кількість повідомлень наближається до ліміту до 15.000.000. Будьте уважні",
        "Кількість повідомлень наближається до ліміту до 15.000.000. Рекомендуємо завантажити архів із повідомленнями",
      ];
    case 114:
      return [
        "Колькасць паведамленняў у межах нормы. Можаце карыстацца мэсанджарам",
        "Колькасць паведамленняў набліжаецца да абмежавальніка ў 15.000.000. Будзьце ўважлівыя",
        "Колькасць паведамленняў набліжаецца да абмежавальніка ў 15.000.000. Рэкамендуем спампаваць архіў з паведамленнямі",
      ];
    case 2:
      return [
        "Колькасць паведамленняў у межах нормы. Можаце карыстацца мэсанджарам",
        "Колькасць паведамленняў набліжаецца да абмежавальніка ў 15.000.000. Будзьце ўважлівыя",
        "Колькасць паведамленняў набліжаецца да абмежавальніка ў 15.000.000. Рэкамендуем спампаваць архіў з паведамленнямі",
      ];
    case 777:
      return [
        "Количество телеграмм в пределах нормы. Можете пользоваться телеграфом",
        "Количество телеграмм приближается к ограничителю в 15.000.000. Будьте внимательны",
        "Количество телеграмм приближается к ограничителю в 15.000.000. Рекомендуем скачать досье с телеграммами",
      ];
    case 97:
      return [
        "Хабарламалар саны қалыпты шектерде. Сіз мессенджерді пайдалана аласыз",
        "Хабарламалар саны 15.000.000 шегіне жақындап қалды. Сақ болыңыз",
        "Хабарламалар саны 15.000.000 шегіне жақындап қалды. Хабарламалары бар мұрағатты жүктеп алуды ұсынамыз",
      ];
    case 100:
      return [
        "Количество сообщений в пределах нормы. Можете пользоваться мессенджером",
        "Количество сообщений приближается к ограничителю в 15.000.000. Будьте внимательны",
        "Количество сообщений приближается к ограничителю в 15.000.000. Рекомендуем скачать архив с сообщениями",
      ];
    default:
      return [
        "The number of messages is within normal limits. You can use messenger",
        "The number of messages is approaching the limit of 15.000.000. Be careful",
        "The number of messages is approaching the limit of 15.000.000. We recommend downloading the archive with messages",
      ];
  }
}

export default getTextTTNum;