const installBoxTitle = (lang: number) => {
  switch (lang) {
    case 0:
      return ["VK Tools установлен","Для быстрого доступа к настройкам расширения вам нужно закрепить его","Нажмите на иконку пазлов","Найдите VK Tools в списке расширений",'Нажмите на "булавку"',"Остались вопросы?","Напишите нам","и мы постараемся решить их!"];
    case 1:
      return ["VK Tools встановлено","Для швидкого доступу до налаштувань розширення вам потрібно закріпити його","Натисніть на іконку пазлів","Знайдіть VK Tools у списку розширень",'Натисніть на "шпильку"',"Залишилися питання?","Напишіть нам","І ми постараємося вирішити їх!"];
    case 454:
      return ["VK Tools встановлено","Для швидкого доступу до налаштувань розширення вам потрібно закріпити його","Натисніть на іконку пазлів","Знайдіть VK Tools у списку розширень",'Натисніть на "шпильку"',"Залишилися питання?","Напишіть нам","І ми постараємося вирішити їх!"];
    case 114:
      return ["VK Tools усталяваны","Для хуткага доступу да налад пашырэння вам трэба замацаваць яго","Націсніце на абразок пазлаў","Знайдзіце VK Tools у спісе пашырэнняў",'Націсніце на "шпільку"',"Засталіся пытанні?","Напішыце нам","і мы пастараемся вырашыць іх!"];
    case 2:
      return ["VK Tools усталяваны","Для хуткага доступу да налад пашырэння вам трэба замацаваць яго","Націсніце на абразок пазлаў","Знайдзіце VK Tools у спісе пашырэнняў",'Націсніце на "шпільку"',"Засталіся пытанні?","Напішыце нам","і мы пастараемся вырашыць іх!"];
    case 777:
      return ["VK Tools установлен","Для быстрого доступа к настройкам расширения вам нужно закрепить его","Нажмите на иконку пазлов","Найдите VK Tools в списке расширений",'Нажмите на "булавку"',"Остались вопросы?","Напишите нам","и мы постараемся решить их!"];
    case 97:
      return ["VK Tools орнатылды","Кеңейтім параметрлеріне жылдам қол жеткізу үшін оны бекіту керек","Пазл белгішесін басыңыз","Кеңейтімдер тізімінен VK Tools табыңыз",'"PIN" белгісін басыңыз',"Сұрақтар қалды ма?","Бізге жазыңыз","және біз оларды шешуге тырысамыз!"];
    case 100:
      return ["VK Tools установлен","Для быстрого доступа к настройкам расширения вам нужно закрепить его","Нажмите на иконку пазлов","Найдите VK Tools в списке расширений",'Нажмите на "булавку"',"Остались вопросы?","Напишите нам","и мы постараемся решить их!"];
    default:
      return ["VK Tools successfully installed","For quick access to extension settings, you need to pin it","Click on the puzzle icon","Find VK Tools in the list of extensions",'Click on the "pin" icon',"Any questions left?","Write to us","and we will try to solve them!"];
  }
}

export default installBoxTitle;