const getAudioDescriptionText = (lang:number) => {
  switch (lang) {
    case 0:
      return "Прежде чем загружать аудиосообщение, убедитесь в том, что оно записано не в стерео, а в моно. Иначе оно не будет воспроизводиться в приложении на смартфонах";
    case 1:
      return "Перш ніж завантажувати аудіоповідомлення, переконайтеся в тому, що воно записане не в стерео, а в моно. Інакше воно не буде відтворюватися в додатку на смартфонах";
    case 454:
      return "Перш ніж завантажувати аудіоповідомлення, переконайтеся в тому, що воно записане не в стерео, а в моно. Інакше воно не буде відтворюватися в додатку на смартфонах";
    case 114:
      return "Перш чым загружаць аўдыяпаведамленне, пераканайцеся ў тым, што яно запісана не ў стэрэа, а ў мона. Інакш яно не будзе прайгравацца ў праграме на смартфонах";
    case 2:
      return "Перш чым загружаць аўдыяпаведамленне, пераканайцеся ў тым, што яно запісана не ў стэрэа, а ў мона. Інакш яно не будзе прайгравацца ў праграме на смартфонах";
    case 777:
      return "Прежде чем загружать радиограмму, убедитесь в том, что оно записано не в стерео, а в моно. Иначе оно не будет воспроизводиться в программе на карманных ЭВМ";
    case 97:
      return "Аудио хабарламаны жүктеп салу алдында оның стерео емес, моно форматта жазылғанына көз жеткізіңіз. Әйтпесе, ол смартфондардағы қолданбада ойнатылмайды";
    case 100:
      return "Прѣждѣ чемъ загружать аудiосообщенiя, убѣдитѣсь въ томъ, что оно записано не въ стѣрѣо, а въ моно. Иначе оно не будѣтъ воспроизводиться въ прiложѣнiи на смартфонахъ";
    default:
      return "Before you upload an audio message, make sure that it is not recorded in stereo, but in mono. Otherwise it will not play in the app on smartphones";
  }
}

export default getAudioDescriptionText