export const getUnsupportedLangAttaches = (lang:number) => {
  switch (lang) {
    case 0:
      return "Функция «Старый дизайн вложений» не поддерживается с видом сообщений «Блоки»";
    case 1:
      return 'Функція "Старий дизайн вкладень" не підтримується з виглядом повідомлень "Блоки"';
    case 454:
      return 'Функція "Старий дизайн вкладень" не підтримується з виглядом повідомлень "Блоки"';
    case 114:
      return 'Функцыя "Стары дызайн укладанняў" не падтрымліваецца з выглядам паведамленняў "Блокі"';
    case 2:
      return 'Функцыя "Стары дызайн укладанняў" не падтрымліваецца з выглядам паведамленняў "Блокі"';
    case 777:
      return "Функция «Старый дизайн вложений» не поддерживается с видом сообщений «Блоки»";
    case 97:
      return "Ескі тіркеме дизайны мүмкіндігіне блоктау хабары түрімен қолдау көрсетілмейді.";
    case 100:
      return "Функция «Старый дизайн вложений» не поддерживается с видом сообщений «Блоки»";
    default:
      return "The Old Attachment Design feature is not supported with the Blocks message type.";
  }
}

export const getUnsupportedLangOldM = (lang: number) => {
  switch (lang) {
    case 0:
      return "Функция «Старый дизайн мессенджера» не поддерживается с видом сообщений «Блоки»";
    case 1:
      return 'Функція "Старий дизайн мессенджера" не підтримується з виглядом повідомлень "Блоки"';
    case 454:
      return 'Функція "Старий дизайн мессенджера" не підтримується з виглядом повідомлень "Блоки"';
    case 114:
      return 'Функцыя "Стары дызайн мессенджэра" не падтрымліваецца з выглядам паведамленняў "Блокі"';
    case 2:
      return 'Функцыя "Стары дызайн мессенджэра" не падтрымліваецца з выглядам паведамленняў "Блокі"';
    case 777:
      return "Функция «Старый дизайн мессенджера» не поддерживается с видом сообщений «Блоки»";
    case 97:
      return "Ескі мессенджер дизайны мүмкіндігіне блоктау хабары түрімен қолдау көрсетілмейді.";
    case 100:
      return "Функция «Старый дизайн мессенджера» не поддерживается с видом сообщений «Блоки»";
    default:
      return "The Old Messenger Design feature is not supported with the Blocks message type.";
  }
}
