/* eslint-disable no-dupe-keys */
const convertLayout = (text: string): string => {
  const layoutMap: { [key: string]: string } = {
    а: "f",  б: ",",  в: "d",  г: "u",  д: "l",  е: "t",  ё: "`",
    ж: ";",  з: "p",  и: "b",  й: "q",  к: "r",  л: "k",  м: "v",
    н: "y",  о: "j",  п: "g",  р: "h",  с: "c",  т: "n",  у: "e",
    ф: "a",  х: "[",  ц: "w",  ч: "x",  ш: "i",  щ: "o", ъ: "]",
    ы: "s",  ь: "m",  э: "'",   ю: ".",   я: "z",

    F: "А",  ",": "Б", D: "В", U: "Г", L: "Д",
    T: "Е", P: "З", B: "И",
    Q: "Й", R: "К", K: "Л", V: "М", Y: "Н",
    J: "О", G: "П", H: "Р", C: "С", N: "Т",
    E: "У", A: "Ф", W: "Ц", X: "Ч",
    I: "Ш", O: "Щ", S: "Ы", M: "Ь",
    Z: "Я",

    f: "а", b:"и" , d:"в" , u:"г" , l:"д" , t:"е" , "`":"ё" ,
    ";":"ж" , p:"з" , q:"й" , r:"к" , k:"л" , v:"м" , y:"н" ,
    j:"о" , g:"п" , h:"р" , c:"с" , n:"т" , e:"у" ,
    a:"ф" , "[":"х" , w:"ц" , x:"ч" , i:"ш" ,
    o:"щ" , "]":"ъ" , s:"ы" , m:"ь" , "'":"э" ,
    ".":"ю" , z:"я",

   А: "F"
   , Б: ","
   , В:"D"
   , Г:"U"
   , Д:"L"
   , Е:"T"
   , Ё:"`"
   , Ж:";"
   , З:"P"
   , И:"B"
   , Й:"Q"
   , К:"R"
   , Л:"K"
   , М:"V"
   , Н:"Y"
   , О:"J"
   , П:"G"
   , Р:"H"
   , С:"C"
   , Т:"N"
   , У:"E"
   , Ф:"A"
   , Х:"["
   , Ц:"W"
   , Ч:"X"
   , Ш:"I"
   , Щ:"O"
   , Ъ: "]"
   , Ы: "S"
   , Ь: "M"
   , Э: "'"
   , Ю: "."
   , Я: "Z"
};

  return text
    .split("")
    .map((char) => layoutMap[char] || char)
    .join("");
}

export default convertLayout;
