const refreshButtonTextLang = (lang:number) => {
  switch (lang) {
    case 0:
      return ['Не удалось включить старый редактор постов','Попробуйте нажать на кнопку "Подгрузить старый постинг"','Подгрузить старый постинг','Попытка включения...'];
    case 1:
      return ['Не вдалося включити старий редактор постів','Спробуйте натиснути кнопку "Підвантажити старий постінг"','Підвантажити старий постінг','Спроба включення...'];
    case 454:
      return ['Не вдалося включити старий редактор постів','Спробуйте натиснути кнопку "Підвантажити старий постінг"','Підвантажити старий постінг','Спроба включення...'];
    case 114:
      return ['Не атрымалася ўлучыць стары рэдактар ​​пастоў','Паспрабуйце націснуць на кнопку "Падгрузіць стары постынга"','Падгрузіць стары постынга','Спроба ўключэння...'];
    case 2:
      return ['Не атрымалася ўлучыць стары рэдактар ​​пастоў','Паспрабуйце націснуць на кнопку "Падгрузіць стары постынга"','Падгрузіць стары постынга','Спроба ўключэння...'];
    case 777:
      return ['Не удалось включить старый редактор постов','Попробуйте нажать на кнопку "Подгрузить старый постинг"','Подгрузить старый постинг','Попытка включения...'];
    case 97:
      return ['Ескі хабарлама өңдегішін қосу мүмкін болмады','"Ескі хабарламаны жүктеу" түймесін басып көріңіз','Ескі хабарламаны жүктеу','Қосу әрекеті...'];
    case 100:
      return ['Не удалось включить старый редакторъ постовъ','Попробуйте нажать на кнопку "​Подгрузить​ старый ​постингъ​"','​Подгрузить​ старый ​постингъ​','Попытка включенія...' ]; 
    default:
      return ['Failed to enable old post editor','Try clicking on the "Load old posting" button','Load old posting','Attempt to turn on...'];
  }
}

export default refreshButtonTextLang;