const buttonsLang = (lang: number) => {
  switch (lang) {
    case 0:
      return ["Подписаться", "Подать заявку", "Отменить заявку", "Вы подписаны", "Отписаться", "Скрывать новости", "Показывать новости"];
    case 1:
    case 454:
      return ["Підписатися", "Подати заявку", "Відмінити заявку", "Ви підписані", "Відписатися", "Приховувати новини", "Показувати новини"];
    case 114:
    case 2:
      return ["Падпісацца", "Падаць заяўку", "Адмяніць заяўку", "Вы падпісаны", "Адпісацца", "Хаваць навіны", "Паказваць навіны"];
    case 777:
      return ["Изменить статус", "Подать заявку", "Отменить заявку", "Вы подписаны", "Отписаться", "Скрывать новости", "Показывать новости"];
    case 97:
      return ["Жазылу", "Өтініш беру", "Өтінішті болдырмау", "Сіз жазылдыңыз", "Жазылымнан бас тарту", "Жаңалықтарды жасыру", "Жаңалықтарды көрсету"];
    case 100:
      return ["Изменити подписку", "Подати прошеніе", "Отменити прошеніе", "Вы подписаны", "Отписатися", "Скрыти новости", "Показати новости"];
    default:
      return ["Subscribe", "Apply", "Cancel application", "You are subscribed", "Unsubscribe", "Hide news", "Show news"];
  }
};

export default buttonsLang;
