const getAudioContLang = (lang: number) => {
  switch (lang) {
    case 0:
      return ["","аудиозапись","аудиозаписи","аудиозаписей"];
    case 1:
      return ["","аудіозапис","аудіозаписи","аудіозаписів"];
    case 454:
      return ["","аудіозапис","аудіозаписи","аудіозаписів"];
    case 114:
      return ["","аўдыязапіс","аўдыязапісы","аўдыязапісаў"];
    case 2:
      return ["","аўдыязапіс","аўдыязапісы","аўдыязапісаў"];
    case 777:
      return ["","звукозапись","звукозаписи","звукозаписей"];
    case 97:
      return ["","аудиожазба","аудиожазба","аудиожазба"];
    case 100:
      return ["","композицiя","композицiи","композицiяй"];
    default:
      return ["","track","tracks"];
  }
}

export default getAudioContLang;