      const getMoreInfoLang = (lang:number) => {
        switch (lang) {
          case 0:
            return [
              "Показать подробную информацию",
              "Скрыть подробную информацию",
            ];
          case 1:
            return [
              "Показати детальну інформацію",
              "Приховати детальну інформацію",
            ];
          case 454:
            return [
              "Показати детальну інформацію",
              "Приховати детальну інформацію",
            ];
          case 114:
            return [
              "Паказаць падрабязную інфармацыю",
              "Схаваць падрабязную інфармацыю",
            ];
          case 2:
            return [
              "Паказаць падрабязную інфармацыю",
              "Схаваць падрабязную інфармацыю",
            ];
          case 777:
            return ["Раскрыть детальное досье", "Убрать детальное досье"];
          case 97:
            return ["Толық ақпаратты көрсету", "Толық ақпаратты жасыру"];
          case 100:
            return [
              "Показать подробную информацiю",
              "Скрыть подробную информацiю",
            ];
          default:
            return ["Show detailed information", "Hide detailed information"];
        }
}
      
export default getMoreInfoLang;