const getZodiacSigns = (lang: number) => {
  switch (lang) {
    case 0:
      return [
        "Овен",
        "Телец",
        "Близнецы",
        "Рак",
        "Лев",
        "Дева",
        "Весы",
        "Скорпион",
        "Стрелец",
        "Козерог",
        "Водолей",
        "Рыбы",
      ];
    case 1:
    case 454:
      return [
        "Овен",
        "Телец",
        "Близнюки",
        "Рак",
        "Лев",
        "Діва",
        "Терези",
        "Скорпіон",
        "Стрілець",
        "Козеріг",
        "Водолій",
        "Риби",
      ];
    case 2:
    case 114:
      return [
        "Баран",
        "Тэлец",
        "Блізнюкі",
        "Рак",
        "Лев",
        "Дзева",
        "Вагі",
        "Шкапец",
        "Стралец",
        "Козераг",
        "Вадалей",
        "Рыбы",
      ];
    case 777:
    case 100:
      return [
        "Овен",
        "Телец",
        "Близнецы",
        "Рак",
        "Лев",
        "Дева",
        "Весы",
        "Скорпион",
        "Стрелец",
        "Козерог",
        "Водолей",
        "Рыбы",
      ];
    case 97:
      return [
        "Овен",
        "Телец",
        "Близнесін",
        "Рак",
        "Лев",
        "Дева",
        "Терезе",
        "Ақшақар",
        "Оят",
        "Козерге",
        "Суғайыр",
        "Балық",
      ];
    default:
      return [
        "Aries",
        "Taurus",
        "Gemini",
        "Cancer",
        "Leo",
        "Virgo",
        "Libra",
        "Scorpio",
        "Sagittarius",
        "Capricorn",
        "Aquarius",
        "Pisces",
      ];
  }
}

export default getZodiacSigns;